export const categoryData = {
  삼성: {
    모바일: ["스마트폰", "태블릿", "웨어러블"],
    PC: ["노트북/윈도우 태블릿", "데스크톱/올인원모니터"],
    프린터: ["컬러 레이저 복합기", "흑백 레이저 복합기", "잉크젯 복합기", "컬러 레이저 프린터", "흑백 레이저 프린터", "잉크젯 프린터"],
    세탁기: ["드럼 세탁기", "일반 세탁기", "의류 건조기", "에어드레서", "슈드레서"],
    TV: ["LCD/LED/QLED TV", "LCD/LED TV", "PDP TV"],
    에어컨: ["홈멀티 에어컨", "스탠드 에어컨", "벽걸이(창문) 에어컨", "시스템 에어컨", "상업용 스탠드 에어컨", "냉난방기", "온풍기", "포터블쿨러"],
    냉장고: ["4도어 냉장고", "양문형 냉장고", "일반 냉장고", "스탠드형 김치냉장고", "뚜껑형 김치냉장고"],
    청소기: ["로봇 청소기", "무선 청소기", "일반 청소기"],
    공기청정기: ["공기청정기", "제습기", "시스템 제습기"],
    주방가전: ["전자레인지(오븐)", "전기레인지(인덕션)", "식기세척기", "정수기", "가스오븐레인지", "후드"],
    오디오: ["사운드바/홈시어터", "스테레오 오디오", "AI 스피커"],
    스마트싱스: ["스마트싱스", "스마트싱스 스테이션"],
    기타제품: ["비데", "카메라(디지털/갤럭시)", "캠코더", "DVD/블루레이", "전화기", "LED 램프", "기타"]
  },
  LG: {
    TV: ["올레드", "QNED", "나노셀", "울트라 HD", "일반 LED", "라이프스타일 스크린", "TV 세트"],
    오디오: ["블루투스 이어폰", "무선 스피커", "사운드바", "오디오/플레이어"],
    노트북: ["그램 Pro", "그램 Pro 360", "그램", "울트라 PC", "노트북 세트", "Intel Core Ultra", "Copilot+ PC"],
    모니터: ["울트라기어 게이밍모니터", "스마트모니터", "울트라HD 모니터", "울트라와이드 모니터", "PC모니터"],
    냉장고: ["STEM", "상냉장/하냉동", "양문형", "일반형", "페어설치키트", "냉장고 세트"],
    김치냉장고: ["스탠드형", "뚜껑형", "페어설치키트", "김치냉장고 세트"],
    정수기: ["얼음정수기", "냉온정수기", "냉정수기", "정수전용", "온정수기"],
    워시타워: ["워시타워", "워시타워 세트", "워시콤보", "워시콤보 세트"],
    세탁기: ["드럼세탁기", "통돌이", "미니세탁기", "세탁기+건조기", "세탁기 세트"],
    의류건조기: ["건조기", "건조기 세트"],
    의류관리기: ["스타일러", "스타일러 세트"],
    신발관리기: ["슈케이스", "슈케어"],
    청소기: ["무선청소기", "로봇청소기", "유선청소기", "상업용 청소기", "액세사리", "청소기 세트"],
    식물생활가전: ["틔운 미니", "틔운 오브제 컬렉션", "틔운용 씨앗키트 패키지", "틔운 미니용 씨앗키트 패키지", "씨앗키트 홀더", "식물영양제 패키지"],
    에어컨: ["2in1", "스탠드형", "벽걸이형", "창호형/이동식"],
    시스템에어컨: ["주거용 에어컨", "상업용 천장형", "상업용 스탠드"],
    공기청정기: ["360˚ 공기청정기", "에어로시리즈", "휴대용 공기청정기", "공기청정기 세트"],
    제습기: ["제습기"],
    가습기: ["정수 가습기", "자연기화 가습기", "가습기 세트"]
    },
  Apple: {
    Mac: ["MacBook Air", "MacBook Pro", "iMac", "Mac Mini", "Mac Studio", "Mac Pro"],
        iPhone: ["iPhone 15", "iPhone 14", "iPhone 13", "iPhone SE", "기타"],
        iPad: ["iPad Pro", "iPad Air", "iPad Mini", "iPad (일반형)"],
        AppleWatch: ["Series 9", "Ultra 2", "SE"],
        VisionPro: ["Apple Vision Pro"],
        AirPods: ["AirPods Pro", "AirPods (3세대)", "AirPods Max"]
},
  샤오미: {
    모바일: ['휴대폰', '태블릿'],
    웨어러블: ['TWS 이어폰', '스마트 워치', '스마트 밴드'],
    스마트홈: ['TV 및 미디어', '진공 청소기', '환경 가전제품', '홈 보안'],
    라이프스타일: ['건강 및 피트니스']
  }
};
